Autodesk.Revit.DB.Electrical.CircuitType
An enumerated type listing all the possible circuit types.

Autodesk.Revit.DB.Electrical.CircuitType.Space
Circuit type is space.

Autodesk.Revit.DB.Electrical.CircuitType.Spare
Circuit type is spare.

Autodesk.Revit.DB.Electrical.CircuitType.Circuit
Circuit type is circuit.